app/controllers/api/tracks_controller.rb

INSERT INTO "tracks" ("title", "uploader_id", "description", "genre", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @track = Track.new(track_params)
    # debugger
    if @track.save